In [4]:
import pandas as pd

In [5]:
dict = {'days':['day1','day1','day2','day2','day3'], 'employee':['Juan','Jairo','Jair','Alex','Occoner'], 
         'sales':[120,220,350,154,742]}

In [9]:
df = pd.DataFrame(dict)
df

   days employee  sales
0  day1     Juan    120
1  day1    Jairo    220
2  day2     Jair    350
3  day2     Alex    154
4  day3  Occoner    742

In [18]:
df.groupby('days').mean()

      sales
days
day1    170
day2    252
day3    742

In [19]:
df.groupby('days').sum()

      sales
days
day1    340
day2    504
day3    742

In [21]:
df.groupby('days').describe()

     sales
     count   mean         std    min    25%    50%    75%    max
days
day1   2.0  170.0   70.710678  120.0  145.0  170.0  195.0  220.0
day2   2.0  252.0  138.592929  154.0  203.0  252.0  301.0  350.0
day3   1.0  742.0         NaN  742.0  742.0  742.0  742.0  742.0